# Length Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..Length Property
ElectricalSystem Class See Also
---
The Length value of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# Remarks
This property is used to retrieve the Length value of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the length cannot be computed, because it is zero, or because the circuit is not connected to a panel. |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace